cf/DataProcessors/КартаСайтаДляРоботов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>КартаСайтаДляРоботов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

cf/Catalogs/ИнтернетСтатьи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ИнтернетСтатьи</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЭтоНовости</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеСодержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Картинка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСтатьи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСтатьи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьКартинка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьНаСайт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>alies</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РедактированиеТэгами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>h1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>meta_keywords</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>meta_description</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>link_text</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>title_for_link</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСтатьи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипИнтернетСтатьи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемаОтображенияНаСайте</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьНаСайтЛикота</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРодители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Родитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИнтернетСтатьи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/DataProcessors/КартаСайтаДляРоботов/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДВ = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДВ.Фильтр = "Файл XML (*.xml)|*.xml";
	
	Если Дв.Выбрать() Тогда
		
		Объект.ИмяФайла = ДВ.ПолноеИмяФайла;
		
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Функция КоличествоИдТоваров()
	
	Возврат Константы.МаксимальныйПорядковыйНомер.Получить();
	
КонецФункции
&НаСервере
Функция ПолучитьАлиесТовара(НомТовара)
	
	Запрос = Новый Запрос("ВЫБРАТЬ alies ИЗ Справочник.Номенклатура ГДЕ alies <> """" И ПорядковыйНомер = " + Формат(НомТовара,"ЧГ="));
	
	Выполнение = Запрос.Выполнить();
	
	Если Выполнение.Пустой() Тогда
		
		Возврат "";
		
	Иначе
		
		Выборка = Выполнение.Выбрать();
		Возврат Выборка.alies;
		
	КонецЕсли;
	
КонецФункции
&НаСервере
Функция ПолучитьАлиесыТоваров(НачНомер, КОнНомер)
	
	Таблица.Очистить();
	
	Запрос = Новый Запрос("
		|ВЫБРАТЬ 
		|	РАЗЛИЧНЫЕ alies КАК loc, 0 КАК lastmod 
		|ИЗ 
		|	Справочник.Номенклатура 
		|ГДЕ
		|	alies <> """" И
		|	ВыгружатьНаСайт = ИСТИНА И 
		|	ПорядковыйНомер >= " + Формат(НачНомер,"ЧГ=") + " И 
		|	ПорядковыйНомер <= " + Формат(КОнНомер,"ЧГ="));
		
	// подготовим таблицу
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НовСтрока = Таблица.Добавить();
		НовСтрока.loc 		= НРег(Выборка.loc);
		НовСтрока.lastmod 	= XMLСтрока(ТекущаяДата());
      	
	КонецЦикла;
	
	Возврат Истина;
		
КонецФункции
&НаСервере
Функция ПолучитьАлиесыСтаей()
	
	Таблица.Очистить();
	
	Запрос = Новый Запрос("
		|ВЫБРАТЬ Ссылка ПОМЕСТИТЬ ГруппыНовостей ИЗ Справочник.ИнтернетСтатьи ГДЕ ЭтоГруппа = Истина И ЭтоНовости = Истина;
		|ВЫБРАТЬ 
		|	РАЗЛИЧНЫЕ Наименование КАК loc, 0 КАК lastmod 
		|ИЗ 
		|	Справочник.ИнтернетСтатьи 
		|ГДЕ
		|	ЭтоГруппа = ЛОЖЬ И
		|	Не Родитель В(ВЫБРАТЬ Ссылка ИЗ ГруппыНовостей) И
		//|	alies <> """" И
		|	ВыгружатьНаСайт = ИСТИНА
		|");
		
	// подготовим таблицу
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НовСтрока = Таблица.Добавить();
		НовСтрока.loc 		= СтрЗаменить(Выборка.loc, " ", "");
		НовСтрока.lastmod 	= XMLСтрока(ТекущаяДата());
      	
	КонецЦикла;
	
	Возврат Истина;
		
КонецФункции
&НаСервере
Функция ПолучитьАлиесыНовостей()
	
	Таблица.Очистить();
	
	Запрос = Новый Запрос("
		|ВЫБРАТЬ Ссылка ПОМЕСТИТЬ ГруппыНовостей ИЗ Справочник.ИнтернетСтатьи ГДЕ ЭтоГруппа = Истина И ЭтоНовости = Истина;
		|ВЫБРАТЬ 
		|	РАЗЛИЧНЫЕ Наименование КАК loc, 0 КАК lastmod 
		|ИЗ 
		|	Справочник.ИнтернетСтатьи 
		|ГДЕ
		|	ЭтоГруппа = ЛОЖЬ И
		|	Родитель В(ВЫБРАТЬ Ссылка ИЗ ГруппыНовостей) И
		//|	alies <> """" И
		|	ВыгружатьНаСайт = ИСТИНА
		|");
		
	// подготовим таблицу
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НовСтрока = Таблица.Добавить();
		НовСтрока.loc 		= СтрЗаменить(Выборка.loc, " ", "");
		НовСтрока.lastmod 	= XMLСтрока(ТекущаяДата());
      	
	КонецЦикла;
	
	Возврат Истина;
		
КонецФункции

&НаКлиенте
Процедура ЗаписатьСтрокуURL(ЗаписьXML, loc, lastmod)
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("url");
				
	ЗаписьXML.ЗаписатьНачалоЭлемента("loc");
	ЗаписьXML.ЗаписатьТекст(loc);
	ЗаписьXML.ЗаписатьКонецЭлемента();
				
	ЗаписьXML.ЗаписатьНачалоЭлемента("lastmod");
	ЗаписьXML.ЗаписатьТекст(lastmod);
	ЗаписьXML.ЗаписатьКонецЭлемента();
			
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры
&НаКлиенте
Процедура СформироватьФайлКарту(Команда)
	
	НачалоСайта 			= "http://93.153.133.10";
	НачалоТовара 			= "/shop";
	НачалоСтатей			= "/articles";
	НачалоНовостей			= "/news";
	ДатаСайта 				= ТекущаяДата();
	ПространствоИмен		= "http://www.sitemaps.org/schemas/sitemap/0.9";
	ПрефиксПространстваИмен = "lc";
	ТоварыГрузитьПо			= 100;
	
	// Проверим корректность
	
	Если ПустаяСтрока(Объект.ИмяФайла) Тогда                                      
		ОбщиеФункции.СообщитьТекст("Не выбран файл", Элементы.ИмяФайла);
		Возврат;
	КонецЕсли;
	
	// Откроем файл для записи
		
	ЗаписьXML = Новый ЗаписьXML;
	
	Попытка
		ЗаписьXML.ОткрытьФайл(Объект.ИмяФайла, Новый ПараметрыЗаписиXML("windows-1251", "1.0", Истина, Ложь, Символы.Таб));
	Исключение
		ОбщиеФункции.СообщитьТекст(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	// Начнемс
	
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ЗаписьXML.ЗаписатьНачалоЭлемента("urlset");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен(ПрефиксПространстваИмен, ПространствоИмен);
	
	// СТЬИИ
	
	Если ПолучитьАлиесыСтаей() Тогда
		
		Для Каждого Строка Из Таблица Цикл
			
			ЗаписатьСтрокуURL(ЗаписьXML, НачалоСайта + НачалоСтатей + "/" + Строка.loc, Строка.lastmod)
				
		КонецЦикла;
	КонецЕсли;
	
	// НОВОСТИ
	
	Если ПолучитьАлиесыСтаей() Тогда
		
		Для Каждого Строка Из Таблица Цикл
			
			ЗаписатьСтрокуURL(ЗаписьXML, НачалоСайта + НачалоНовостей + "/" + Строка.loc, Строка.lastmod)
				
		КонецЦикла;
	КонецЕсли;
	
	// ТОВАРЫ
	
	Ном 		= 1;
	КолТоваров 	= КоличествоИдТоваров();
	
	Пока Ном < КолТоваров Цикл
	
		ОбработкаПрерыванияПользователя();
		
		Если ПолучитьАлиесыТоваров(Ном, Ном + ТоварыГрузитьПо) Тогда
		
			Для Каждого Строка Из Таблица Цикл
				ЗаписатьСтрокуURL(ЗаписьXML, НачалоСайта + НачалоТовара + "/" + Строка.loc, Строка.lastmod)
			КонецЦикла;
			
		КонецЕсли;
		
		Ном = Ном + ТоварыГрузитьПо;
		
		Состояние("Выгрузка товаров", ном / КолТоваров * 100, "" + Ном + " из " + КолТоваров);
		
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.Закрыть();
	
	ОбщиеФункции.СообщитьТекст("Файл " + Объект.ИмяФайла + " сформирован");
	
КонецПроцедуры


&НаСервере
Процедура ВыполнитьНаСервере()
	
	МодульРегламентныхЗаданий.ВыгрузкаФайлаКартыСайтаДляРоботов();
	
КонецПроцедуры
&НаКлиенте
Процедура СформироватьНаСервере(Команда)
	
	ВыполнитьНаСервере();
	
	ОбщиеФункции.СообщитьТекст("Серваку отпавлена команда, смотри журнал");
	
КонецПроцедуры
